In [2]:
import pandas as pd
import numpy as np
import datetime

In [3]:
ts = pd.Timestamp("2024-06-16 04:30:10") # objeto timestamp
ts

Timestamp('2024-06-16 04:30:10')

In [4]:
datetime.datetime(2024,6,1,4,30,10) # objeto datetime

datetime.datetime(2024, 6, 1, 4, 30, 10)

In [5]:
now = pd.Timestamp.now()
now

Timestamp('2024-06-24 06:43:08.915812')

In [6]:
# converter datatime em timestamp
pd.Timestamp(datetime.datetime.now())

Timestamp('2024-06-24 06:43:08.925466')

In [7]:
data = pd.read_parquet("data+files/stock_data.parquet")

In [8]:
data

             date    close symbol
0      2023-09-05  189.585   AAPL
1      2023-09-01  189.460   AAPL
2      2023-08-31  187.870   AAPL
3      2023-08-30  187.650   AAPL
4      2023-08-29  184.120   AAPL
...           ...      ...    ...
61078  1980-03-21  290.000  BRK.A
61079  1980-03-20  290.000  BRK.A
61080  1980-03-19  290.000  BRK.A
61081  1980-03-18  290.000  BRK.A
61082  1980-03-17  290.000  BRK.A

[61083 rows x 3 columns]

In [9]:
data.info() # a data está em string

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61083 entries, 0 to 61082
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    61083 non-null  object
 1   close   61083 non-null  float64
 2   symbol  61083 non-null  object
dtypes: float64(1), object(2)
memory usage: 1.4+ MB

In [10]:
data.date =pd.to_datetime(data.date)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61083 entries, 0 to 61082
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    61083 non-null  datetime64[ns]
 1   close   61083 non-null  float64
 2   symbol  61083 non-null  object
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 1.4+ MB

In [11]:
data.sample(2)

            date  close symbol
17117 1998-06-17  53.06    IBM
25033 1967-01-06   9.03    IBM

Frequencias de tempo

- B - Dias úteis (exclui finais de semana)
- C - Dias úteis personalizados
- D - Dias calendários
- W - Semanas
- M - Fim do mês
- MS - Início do mês
- Q - Fim do trimestre (março, junho, setembro, dezembro)
- QS - Início do trimestre
- A ou Y - Fim do ano
- AS ou YS - Início do ano
- BA - Fim do ano comercial (fim do mês de abril, junho, setembro ou dezembro)
- BAS - Início do ano comercial
- H - Horas
- T ou min - Minutos
- S - Segundos
- L ou ms - Milissegundos
- U ou us - Microssegundos
- N - Nanosegundos

In [12]:
# criar um range de data

pd.date_range("2023-01-01", periods=1000, freq="S")

DatetimeIndex(['2023-01-01 00:00:00', '2023-01-01 00:00:01',
               '2023-01-01 00:00:02', '2023-01-01 00:00:03',
               '2023-01-01 00:00:04', '2023-01-01 00:00:05',
               '2023-01-01 00:00:06', '2023-01-01 00:00:07',
               '2023-01-01 00:00:08', '2023-01-01 00:00:09',
               ...
               '2023-01-01 00:16:30', '2023-01-01 00:16:31',
               '2023-01-01 00:16:32', '2023-01-01 00:16:33',
               '2023-01-01 00:16:34', '2023-01-01 00:16:35',
               '2023-01-01 00:16:36', '2023-01-01 00:16:37',
               '2023-01-01 00:16:38', '2023-01-01 00:16:39'],
              dtype='datetime64[ns]', length=1000, freq='S')

In [13]:
pd.date_range("2023-01-01", periods=1000, freq="min")

DatetimeIndex(['2023-01-01 00:00:00', '2023-01-01 00:01:00',
               '2023-01-01 00:02:00', '2023-01-01 00:03:00',
               '2023-01-01 00:04:00', '2023-01-01 00:05:00',
               '2023-01-01 00:06:00', '2023-01-01 00:07:00',
               '2023-01-01 00:08:00', '2023-01-01 00:09:00',
               ...
               '2023-01-01 16:30:00', '2023-01-01 16:31:00',
               '2023-01-01 16:32:00', '2023-01-01 16:33:00',
               '2023-01-01 16:34:00', '2023-01-01 16:35:00',
               '2023-01-01 16:36:00', '2023-01-01 16:37:00',
               '2023-01-01 16:38:00', '2023-01-01 16:39:00'],
              dtype='datetime64[ns]', length=1000, freq='T')

In [14]:
pd.date_range("2023-01-01", periods=1000, freq="5min")

DatetimeIndex(['2023-01-01 00:00:00', '2023-01-01 00:05:00',
               '2023-01-01 00:10:00', '2023-01-01 00:15:00',
               '2023-01-01 00:20:00', '2023-01-01 00:25:00',
               '2023-01-01 00:30:00', '2023-01-01 00:35:00',
               '2023-01-01 00:40:00', '2023-01-01 00:45:00',
               ...
               '2023-01-04 10:30:00', '2023-01-04 10:35:00',
               '2023-01-04 10:40:00', '2023-01-04 10:45:00',
               '2023-01-04 10:50:00', '2023-01-04 10:55:00',
               '2023-01-04 11:00:00', '2023-01-04 11:05:00',
               '2023-01-04 11:10:00', '2023-01-04 11:15:00'],
              dtype='datetime64[ns]', length=1000, freq='5T')

In [15]:
pd.date_range("2023-01-01", periods=1000, freq="D")

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10',
               ...
               '2025-09-17', '2025-09-18', '2025-09-19', '2025-09-20',
               '2025-09-21', '2025-09-22', '2025-09-23', '2025-09-24',
               '2025-09-25', '2025-09-26'],
              dtype='datetime64[ns]', length=1000, freq='D')

In [16]:
pd.date_range("2023-01-01", periods=1000, freq="B") # exclui feriados

DatetimeIndex(['2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05',
               '2023-01-06', '2023-01-09', '2023-01-10', '2023-01-11',
               '2023-01-12', '2023-01-13',
               ...
               '2026-10-19', '2026-10-20', '2026-10-21', '2026-10-22',
               '2026-10-23', '2026-10-26', '2026-10-27', '2026-10-28',
               '2026-10-29', '2026-10-30'],
              dtype='datetime64[ns]', length=1000, freq='B')

In [17]:
pd.date_range("2023-01-03", periods=1000, freq="W-MON")
# semanal- ultimo dia da semana, domingo  - "W-MON"segunda, 2W-SAT

DatetimeIndex(['2023-01-09', '2023-01-16', '2023-01-23', '2023-01-30',
               '2023-02-06', '2023-02-13', '2023-02-20', '2023-02-27',
               '2023-03-06', '2023-03-13',
               ...
               '2041-12-30', '2042-01-06', '2042-01-13', '2042-01-20',
               '2042-01-27', '2042-02-03', '2042-02-10', '2042-02-17',
               '2042-02-24', '2042-03-03'],
              dtype='datetime64[ns]', length=1000, freq='W-MON')

In [18]:
pd.date_range("2023-01-01", periods=1000, freq="MS")
# M ultimo dia do mes,MS mes start

DatetimeIndex(['2023-01-01', '2023-02-01', '2023-03-01', '2023-04-01',
               '2023-05-01', '2023-06-01', '2023-07-01', '2023-08-01',
               '2023-09-01', '2023-10-01',
               ...
               '2105-07-01', '2105-08-01', '2105-09-01', '2105-10-01',
               '2105-11-01', '2105-12-01', '2106-01-01', '2106-02-01',
               '2106-03-01', '2106-04-01'],
              dtype='datetime64[ns]', length=1000, freq='MS')

In [19]:
pd.date_range("2023-01-01", periods=1000, freq="6M", unit = "s")
# unit = "s", por usar nano segundos quebra o timestamp

DatetimeIndex(['2023-01-31', '2023-07-31', '2024-01-31', '2024-07-31',
               '2025-01-31', '2025-07-31', '2026-01-31', '2026-07-31',
               '2027-01-31', '2027-07-31',
               ...
               '2518-01-31', '2518-07-31', '2519-01-31', '2519-07-31',
               '2520-01-31', '2520-07-31', '2521-01-31', '2521-07-31',
               '2522-01-31', '2522-07-31'],
              dtype='datetime64[s]', length=1000, freq='6M')

In [20]:
pd.date_range("2023-01-01", periods=1000, freq="BM")
# ultimo dia util da semana mensalmente -BMS primeiro dia util

DatetimeIndex(['2023-01-31', '2023-02-28', '2023-03-31', '2023-04-28',
               '2023-05-31', '2023-06-30', '2023-07-31', '2023-08-31',
               '2023-09-29', '2023-10-31',
               ...
               '2105-07-31', '2105-08-31', '2105-09-30', '2105-10-30',
               '2105-11-30', '2105-12-31', '2106-01-29', '2106-02-26',
               '2106-03-31', '2106-04-30'],
              dtype='datetime64[ns]', length=1000, freq='BM')

In [21]:
pd.date_range("2023-01-01", periods=1000, freq="A", unit = "s")
# anual

DatetimeIndex(['2023-12-31', '2024-12-31', '2025-12-31', '2026-12-31',
               '2027-12-31', '2028-12-31', '2029-12-31', '2030-12-31',
               '2031-12-31', '2032-12-31',
               ...
               '3013-12-31', '3014-12-31', '3015-12-31', '3016-12-31',
               '3017-12-31', '3018-12-31', '3019-12-31', '3020-12-31',
               '3021-12-31', '3022-12-31'],
              dtype='datetime64[s]', length=1000, freq='A-DEC')

Datatime Acessor dt.

In [22]:
s1 = pd.Series(pd.date_range("2023-01-01", periods=1000, freq="D"))
s1

0     2023-01-01
1     2023-01-02
2     2023-01-03
3     2023-01-04
4     2023-01-05
         ...
995   2025-09-22
996   2025-09-23
997   2025-09-24
998   2025-09-25
999   2025-09-26
Length: 1000, dtype: datetime64[ns]

In [23]:
s1.dt.day_name()

0         Sunday
1         Monday
2        Tuesday
3      Wednesday
4       Thursday
         ...
995       Monday
996      Tuesday
997    Wednesday
998     Thursday
999       Friday
Length: 1000, dtype: object

In [24]:
s1.dt.dayofyear

0        1
1        2
2        3
3        4
4        5
      ...
995    265
996    266
997    267
998    268
999    269
Length: 1000, dtype: int32

In [25]:
data.loc[data.date.dt.month==2]
# busco o mes 2 em um dataframe

            date   close symbol
130   2023-02-28  147.41   AAPL
131   2023-02-27  147.92   AAPL
132   2023-02-24  146.71   AAPL
133   2023-02-23  149.40   AAPL
134   2023-02-22  148.91   AAPL
...          ...     ...    ...
60856 1981-02-06  430.00  BRK.A
60857 1981-02-05  430.00  BRK.A
60858 1981-02-04  430.00  BRK.A
60859 1981-02-03  430.00  BRK.A
60860 1981-02-02  430.00  BRK.A

[4635 rows x 3 columns]

In [26]:
s1.dt.strftime("%Y-%m-%d")

0      2023-01-01
1      2023-01-02
2      2023-01-03
3      2023-01-04
4      2023-01-05
          ...
995    2025-09-22
996    2025-09-23
997    2025-09-24
998    2025-09-25
999    2025-09-26
Length: 1000, dtype: object

# Datatime arithmetic e offsets
Offsets olha para o calendário

In [27]:
ts = pd.Timestamp("2024-01-01")
ts

Timestamp('2024-01-01 00:00:00')

In [28]:
# somar - usar Timedelta - semanas é o maior, nao tem ano e mes
ts+pd.Timedelta(weeks=1, days=6, hours=20, minutes=13, seconds=40)

Timestamp('2024-01-14 20:13:40')

In [29]:
# offsets
ts+pd.offsets.Day(2)+10 *pd.offsets.Hour(1)

Timestamp('2024-01-03 10:00:00')

In [30]:
now = pd.Timestamp.now()

In [31]:
now+pd.offsets.MonthEnd(1)

Timestamp('2024-06-30 06:43:10.033559')

In [32]:
now-pd.offsets.BusinessMonthEnd(1)

Timestamp('2024-05-31 06:43:10.033559')

# Resampling

In [33]:
stock_data=pd.read_parquet("data+files/stock_data.parquet")
stock_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61083 entries, 0 to 61082
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    61083 non-null  object
 1   close   61083 non-null  float64
 2   symbol  61083 non-null  object
dtypes: float64(1), object(2)
memory usage: 1.4+ MB

In [34]:
stock_data.date=pd.to_datetime(stock_data.date)
stock_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61083 entries, 0 to 61082
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    61083 non-null  datetime64[ns]
 1   close   61083 non-null  float64
 2   symbol  61083 non-null  object
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 1.4+ MB

In [35]:
example1 = pd.DataFrame(
    {
        "data_time": pd.date_range("2023-01-01", periods=10000, freq="s"),
        "A": range(1,10001)
    }
)
example1

               data_time      A
0    2023-01-01 00:00:00      1
1    2023-01-01 00:00:01      2
2    2023-01-01 00:00:02      3
3    2023-01-01 00:00:03      4
4    2023-01-01 00:00:04      5
...                  ...    ...
9995 2023-01-01 02:46:35   9996
9996 2023-01-01 02:46:36   9997
9997 2023-01-01 02:46:37   9998
9998 2023-01-01 02:46:38   9999
9999 2023-01-01 02:46:39  10000

[10000 rows x 2 columns]

In [36]:
# resample é como um grouby by, no caso agrupa por min.
example1.resample("min", on="data_time").last()

                         A
data_time
2023-01-01 00:00:00     60
2023-01-01 00:01:00    120
2023-01-01 00:02:00    180
2023-01-01 00:03:00    240
2023-01-01 00:04:00    300
...                    ...
2023-01-01 02:42:00   9780
2023-01-01 02:43:00   9840
2023-01-01 02:44:00   9900
2023-01-01 02:45:00   9960
2023-01-01 02:46:00  10000

[167 rows x 1 columns]

In [37]:
example1.resample("min", on="data_time").median()

                          A
data_time
2023-01-01 00:00:00    30.5
2023-01-01 00:01:00    90.5
2023-01-01 00:02:00   150.5
2023-01-01 00:03:00   210.5
2023-01-01 00:04:00   270.5
...                     ...
2023-01-01 02:42:00  9750.5
2023-01-01 02:43:00  9810.5
2023-01-01 02:44:00  9870.5
2023-01-01 02:45:00  9930.5
2023-01-01 02:46:00  9980.5

[167 rows x 1 columns]

In [38]:
example1.resample("min", on="data_time").agg(["mean","last"])

                          A
                       mean   last
data_time
2023-01-01 00:00:00    30.5     60
2023-01-01 00:01:00    90.5    120
2023-01-01 00:02:00   150.5    180
2023-01-01 00:03:00   210.5    240
2023-01-01 00:04:00   270.5    300
...                     ...    ...
2023-01-01 02:42:00  9750.5   9780
2023-01-01 02:43:00  9810.5   9840
2023-01-01 02:44:00  9870.5   9900
2023-01-01 02:45:00  9930.5   9960
2023-01-01 02:46:00  9980.5  10000

[167 rows x 2 columns]

In [39]:
example1.resample("10min", on="data_time").ohlc() # open high low close

                        A
                     open   high   low  close
data_time
2023-01-01 00:00:00     1    600     1    600
2023-01-01 00:10:00   601   1200   601   1200
2023-01-01 00:20:00  1201   1800  1201   1800
2023-01-01 00:30:00  1801   2400  1801   2400
2023-01-01 00:40:00  2401   3000  2401   3000
2023-01-01 00:50:00  3001   3600  3001   3600
2023-01-01 01:00:00  3601   4200  3601   4200
2023-01-01 01:10:00  4201   4800  4201   4800
2023-01-01 01:20:00  4801   5400  4801   5400
2023-01-01 01:30:00  5401   6000  5401   6000
2023-01-01 01:40:00  6001   6600  6001   6600
2023-01-01 01:50:00  6601   7200  6601   7200
2023-01-01 02:00:00  7201   7800  7201   7800
2023-01-01 02:10:00  7801   8400  7801   8400
2023-01-01 02:20:00  8401   9000  8401   9000
2023-01-01 02:30:00  9001   9600  9001   9600
2023-01-01 02:40:00  9601  10000  9601  10000

In [40]:
stock_data

            date    close symbol
0     2023-09-05  189.585   AAPL
1     2023-09-01  189.460   AAPL
2     2023-08-31  187.870   AAPL
3     2023-08-30  187.650   AAPL
4     2023-08-29  184.120   AAPL
...          ...      ...    ...
61078 1980-03-21  290.000  BRK.A
61079 1980-03-20  290.000  BRK.A
61080 1980-03-19  290.000  BRK.A
61081 1980-03-18  290.000  BRK.A
61082 1980-03-17  290.000  BRK.A

[61083 rows x 3 columns]

In [42]:
stock_data.symbol.value_counts()

symbol
IBM      15525
WMT      12866
JPM      10960
BRK.A    10960
AAPL     10772
Name: count, dtype: int64

In [43]:
stock_data.agg(["min", "max"])

          date          close symbol
min 1962-01-02       0.015625   AAPL
max 2023-09-05  553101.000000    WMT

In [48]:
stock_data.groupby("symbol")[["date", "close"]].resample("M", on="date").last()

                       close
symbol date
AAPL   1980-12-31    0.15234
       1981-01-31    0.12612
       1981-02-28    0.11830
       1981-03-31    0.10938
       1981-04-30    0.12667
...                      ...
WMT    2023-05-31  146.87000
       2023-06-30  157.18000
       2023-07-31  159.86000
       2023-08-31  162.61000
       2023-09-30  161.44500

[2915 rows x 1 columns]

In [52]:
monthly_stock = (stock_data
                 .groupby("symbol")[["date", "close"]]
                 .resample("M", on="date")
                 .ohlc()
                 .reset_index()
                 )

In [56]:
monthly_stock[monthly_stock.symbol=="AAPL"]

    symbol       date      close
                            open       high        low      close
0     AAPL 1980-12-31    0.12835    0.16071    0.11272    0.15234
1     AAPL 1981-01-31    0.15402    0.15402    0.12612    0.12612
2     AAPL 1981-02-28    0.11886    0.12835    0.10603    0.11830
3     AAPL 1981-03-31    0.11886    0.11942    0.09654    0.10938
4     AAPL 1981-04-30    0.10826    0.13058    0.10826    0.12667
..     ...        ...        ...        ...        ...        ...
509   AAPL 2023-05-31  169.59000  177.30000  165.79000  177.25000
510   AAPL 2023-06-30  180.09000  193.97000  177.82000  193.97000
511   AAPL 2023-07-31  192.46000  196.45000  188.08000  196.45000
512   AAPL 2023-08-31  195.61000  195.61000  174.00000  187.87000
513   AAPL 2023-09-30  189.46000  189.58500  189.46000  189.58500

[514 rows x 6 columns]

In [54]:
annual_stock = (stock_data
                 .groupby("symbol")[["date", "close"]]
                 .resample("A", on="date")
                 .ohlc()
                 .reset_index()
                 )

In [55]:
annual_stock

    symbol       date       close
                             open       high         low       close
0     AAPL 1980-12-31    0.128350    0.16071    0.112720    0.152340
1     AAPL 1981-12-31    0.154020    0.15402    0.063616    0.098772
2     AAPL 1982-12-31    0.098214    0.15123    0.049107    0.133370
3     AAPL 1983-12-31    0.127230    0.28013    0.079799    0.108820
4     AAPL 1984-12-31    0.114400    0.14844    0.097656    0.130020
..     ...        ...         ...        ...         ...         ...
241    WMT 2019-12-31   93.340000  121.28000   92.860000  118.840000
242    WMT 2020-12-31  118.940000  152.79000  104.050000  144.150000
243    WMT 2021-12-31  146.530000  151.45000  127.530000  144.690000
244    WMT 2022-12-31  144.650000  159.87000  118.290000  141.790000
245    WMT 2023-12-31  143.600000  162.61000  136.970000  161.445000

[246 rows x 6 columns]

outra abordagem

In [57]:
stock_data.index =stock_data.date

In [58]:
stock_data

                 date    close symbol
date
2023-09-05 2023-09-05  189.585   AAPL
2023-09-01 2023-09-01  189.460   AAPL
2023-08-31 2023-08-31  187.870   AAPL
2023-08-30 2023-08-30  187.650   AAPL
2023-08-29 2023-08-29  184.120   AAPL
...               ...      ...    ...
1980-03-21 1980-03-21  290.000  BRK.A
1980-03-20 1980-03-20  290.000  BRK.A
1980-03-19 1980-03-19  290.000  BRK.A
1980-03-18 1980-03-18  290.000  BRK.A
1980-03-17 1980-03-17  290.000  BRK.A

[61083 rows x 3 columns]

In [61]:
# como date é o index, nao precisa no resample
annual_stock = (stock_data
                 .groupby("symbol")["close"]
                 .resample("A")
                 .ohlc()
                 .reset_index()
                 )

In [62]:
annual_stock

    symbol       date        open       high         low       close
0     AAPL 1980-12-31    0.128350    0.16071    0.112720    0.152340
1     AAPL 1981-12-31    0.154020    0.15402    0.063616    0.098772
2     AAPL 1982-12-31    0.098214    0.15123    0.049107    0.133370
3     AAPL 1983-12-31    0.127230    0.28013    0.079799    0.108820
4     AAPL 1984-12-31    0.114400    0.14844    0.097656    0.130020
..     ...        ...         ...        ...         ...         ...
241    WMT 2019-12-31   93.340000  121.28000   92.860000  118.840000
242    WMT 2020-12-31  118.940000  152.79000  104.050000  144.150000
243    WMT 2021-12-31  146.530000  151.45000  127.530000  144.690000
244    WMT 2022-12-31  144.650000  159.87000  118.290000  141.790000
245    WMT 2023-12-31  143.600000  162.61000  136.970000  161.445000

[246 rows x 6 columns]